espressif/esp-iot-solution/examples/hmi/perf_benchmark/sdkconfig.ci.perf_esp32c3
CONFIG_IDF_TARGET="esp32c3"
# For IDF 5.0
CONFIG_ESP_TASK_WDT_EN=n

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_SIZE_KILOBYTES=128
CONFIG_LV_MEM_BUF_MAX_NUM=10
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
